In [1]:
import pandas as pd # import pandas for scrapping data of chicago Neiborhood and community name from html file

In [2]:
 pd.__version__

'0.23.4'

In [6]:
table = pd.read_html('https://en.wikipedia.org/wiki/List_of_neighborhoods_in_Chicago', index_col= False)

In [11]:
d =table[0]

In [17]:
d.columns =[ 'Neighborhood','Community'] # fix the index name with proper name

In [18]:
d.head()

      Neighborhood       Community
0     Neighborhood  Community area
1      Albany Park     Albany Park
2  Altgeld Gardens       Riverdale
3    Andersonville       Edgewater
4   Archer Heights  Archer Heights

In [31]:
 df = d.drop([0])# drop the row ,look the  first row of previous cell

In [25]:
df.head(3)

      Neighborhood    Community
1      Albany Park  Albany Park
2  Altgeld Gardens    Riverdale
3    Andersonville    Edgewater

In [28]:
df1 =df[df['Community'] =='Uptown'].reset_index(drop=True)

In [29]:
df1.shape

(6, 2)

In [30]:
df1.head(6)

     Neighborhood Community
0      Buena Park    Uptown
1  Clarendon Park    Uptown
2    Margate Park    Uptown
3   New Chinatown    Uptown
4   Sheridan Park    Uptown
5          Uptown    Uptown

In [32]:
df2 = df1.drop([3,5])

In [33]:
df2.head()

     Neighborhood Community
0      Buena Park    Uptown
1  Clarendon Park    Uptown
2    Margate Park    Uptown
4   Sheridan Park    Uptown

In [34]:
Longitude =[-87.652833, -87.648842,-87.652863,-87.654807]

In [35]:
Latitude =[41.957810,41.963275, 41.972465,41.871054]

In [37]:
D= pd.read_csv()

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (<ipython-input-37-689ac754eb68>, line 1)

In [ ]:
pd.read_csv('')